-- создание таблицы типов
create table type
(
    id    serial primary key,
    name  varchar(25)
);

-- создание таблицы продуктов
create table product
(
    id    serial primary key,
    name  varchar(50), 
    price DECIMAL(8,2),
	expired_date DATE,
	type_id int references type (id)
);

-- вставка данных таблицы типов
insert into type(name) values
('Зерномучные товары'),
('Плодово-овощные товары'),
('Вкусовые товары'),
('Сладости'),
('Мясо'),
('Рыба'),
('Сыр'),
('Молоко');

-- вставка данных таблицы продуктов
insert into product(name, price, expired_date, type_id) values
('Батон белый', 49.90, '2024-02-28', 1),
('Батон черный', 45.65, '2024-02-25', 1),
('Лаваш', 30.50, '2024-01-28', 1),
('Пончик', 10.90, '2024-02-24', 1),
('Яблоко', 49.90, '2024-03-25', 2),
('Банан', 99.90, '2024-03-15', 2),
('Капуста', 5.05, '2024-04-10', 2),
('Клубника', 149.99, '2024-03-10', 2),
('Виноград', 49.90, '2024-03-25', 2),
('Ананас', 99.90, '2024-03-15', 2),
('Смородина', 5.05, '2024-04-10', 2),
('Ежевика', 149.99, '2024-03-10', 2),
('Мандарин', 49.90, '2024-03-25', 2),
('Апельсин', 99.90, '2024-03-15', 2),
('Груша', 5.05, '2024-04-10', 2),
('Арбуз', 149.99, '2024-03-10', 2),
('Приправа для шашлыка', 15.50, '2024-01-18', 3),
('Лавровый лист', 299.95, '2024-03-18', 3),
('Перец красный', 9.50, '2024-01-18', 3),
('Сливочное мороженое', 20.45, '2024-06-18', 4),
('Конфеты', 20.45, '2024-02-18', 4),
('Торт', 240.65, '2024-01-18', 4),
('Сахарная вата', 20.45, '2024-06-18', 4),
('Мясо мороженое', 350.00, '2024-06-18', 5),
('Мясо парное', 750.00, '2024-02-18', 5),
('Сосиски', 180.20, '2024-03-18', 5),
('Бекон', 200.05, '2024-06-18', 5),
('Филе минтая мороженое', 150.00, '2024-06-18', 6),
('Горбуша', 400.00, '2024-01-18', 6),
('Карп', 150.00, '2024-02-18', 6),
('Моцарелла', 900.00, '2024-02-18', 7),
('Маасдам', 950.00, '2024-02-18', 7),
('Тильзитер', 750.00, '2024-02-18', 7),
('Гауда', 700.00, '2024-02-18', 7),
('Молоко цельное', 70.00, '2024-01-18', 8),
('Молоко сгущеное', 160.00, '2024-06-18', 8),
('Сливки', 120.00, '2024-02-25', 8),
('Ряженка', 70.00, '2024-02-08', 8);





